#include "Status.h"
typedef int ElemType;
#include "struct TSMatrix.h"
#include "B_opera_fun_called_fun.h"
#include "Basic_operation_functions.h"
#include "Universa_ts_b_opera_fun.h"
#include "Universal_main.h"
/*------------------------------------------------------------------------------------
创建稀疏矩阵A:请输入稀疏矩阵的行数、列数和非零元素个数（小于100）:3,3,2
请输入第1个非零元素的行（1~3）、列(1~3)和元素值:1,2,1
请输入第2个非零元素的行（1~3）、列(1~3)和元素值:2,2,2
  0  1  0
  0  2  0
  0  0  0
由矩阵A复制矩阵B:
  0  1  0
  0  2  0
  0  0  0
销毁矩阵B后：
创建矩阵B2:(与矩阵A的行、列数相同，行、列分别为3,3)
请输入稀疏矩阵的行数、列数和非零元素个数（小于100）:3,3,1
请输入第1个非零元素的行（1~3）、列(1~3)和元素值:1,2,1
  0  1  0
  0  0  0
  0  0  0
矩阵C1(A + B):
  0  2  0
  0  2  0
  0  0  0
矩阵C2(A - B):
  0  0  0
  0  2  0
  0  0  0
矩阵C3(A的转置矩阵):
  0  0  0
  1  2  0
  0  0  0
创建稀疏矩阵A2:请输入稀疏矩阵的行数、列数和非零元素个数（小于100）:2,3,2
请输入第1个非零元素的行（1~2）、列(1~3)和元素值:1,1,1
请输入第2个非零元素的行（1~2）、列(1~3)和元素值:2,3,2
  1  0  0
  0  0  2
创建稀疏矩阵B3(行数和矩阵A2的列数相同 = 3):请输入稀疏矩阵的行数、列数和非零元素
个数（小于100）:3,2,2
请输入第1个非零元素的行（1~3）、列(1~2)和元素值:2,2,1
请输入第2个非零元素的行（1~3）、列(1~2)和元素值:3,1,2
  0  0
  0  1
  2  0
矩阵C5(A * B):
  0  0
  4  0
请按任意键继续. . .
  ------------------------------------------------------------------------------------
*/